Script started on 2020-09-13 19:11:50-04:00 [TERM="xterm-256color" TTY="/dev/pts/8" COLUMNS="109" LINES="53"]
cyang58@remote03:~/i220a/submit/lab2$ cd e[K[K !/[K~/[K[K[K~/2[Kcs220[K0/labs/ee[K[K
index.html  index.umt   lab0/       lab1/       lab2/       working/    
cyang58@remote03:~/i220a/submit/lab2$ cd ~/cs220/labs/labb[K2/exercises/1-hello-args/
cyang58@remote03:~/cs220/labs/lab2/exercises/1-hello-args$ ls[K[Kclear
[H[2J[3Jcyang58@remote03:~/cs220/labs/lab2/exercises/1-hello-args$ ls
hello  hello.c	Makefile  README
cyang58@remote03:~/cs220/labs/lab2/exercises/1-hello-args$ ls -l
total 32
-rwxr-x--- 1 cyang58 cyang58 19360 Sep 13 18:59 hello
-rw-r----- 1 cyang58 cyang58   343 Sep 13 18:58 hello.c
-rw-r----- 1 cyang58 cyang58    35 Sep 13 18:58 Makefile
-rw-r----- 1 cyang58 cyang58    61 Sep 13 18:58 README
cyang58@remote03:~/cs220/labs/lab2/exercises/1-hello-args$ make
make: 'hello' is up to date.
cyang58@remote03:~/cs220/labs/lab2/exercises/1-hello-args$ .hel[K[K[K/hello bart lisa
hello bart
hello lisa
hello (null)
cyang58@remote03:~/cs220/labs/lab2/exercises/1-hello-args$ gfb[K[Kdb hello
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) start a[Kbart lisa
Temporary breakpoint 1 at 0x118b: file hello.c, line 13.
Starting program: /import/linux/home1/cyang58/projects/cs220/labs/lab2/exercises/1-hello-args/hello bart lisa

Temporary breakpoint 1, main (argc=3, argv=0x7fffffffe7d8) at hello.c:13
13	  if (argc == 1) {
(gdb) 1
Undefined command: "1".  Try "help".
(gdb) 
Undefined command: "1".  Try "help".
(gdb) 1 1
Undefined command: "1".  Try "help".
(gdb) Âêßs[K[Ks[Kb say_hello
Breakpoint 2 at 0x555555555161: file hello.c, line 7.
(gdb) b say_hello 
Note: breakpoint 2 also set at pc 0x555555555161.
Breakpoint 3 at 0x555555555161: file hello.c, line 7.
(gdb) ./je[K[Khello isa bart, [K[K[K[K[K[K[K[K[K[K[K lisa,[K bart, argc == 3
Undefined command: "".  Try "help".
(gdb) n
18	    for (int i = 1; i <= argc; i++) {
(gdb) n
19	      say_hello(argv[i]);
(gdb) p a[K[K[Kn./hello lisa bart, argc == 3[C[C[C[C[C[Cn[K[Kp argc
$1 = 3
(gdb) c
Continuing.

Breakpoint 2, say_hello (name=0x7fffffffeab0 "bart") at hello.c:7
7	  printf("hello %s\n", name);
(gdb) 1
Undefined command: "1".  Try "help".
(gdb) p name
$2 = 0x7fffffffeab0 "bart"
(gdb) backtrace
#0  say_hello (name=0x7fffffffeab0 "bart") at hello.c:7
#1  0x00005555555551e5 in main (argc=3, argv=0x7fffffffe7d8) at hello.c:19
(gdb) down
Bottom (innermost) frame selected; you cannot go down.
(gdb) c
Continuing.
hello bart

Breakpoint 2, say_hello (name=0x7fffffffeab5 "lisa") at hello.c:7
7	  printf("hello %s\n", name);
(gdb) n
hello lisa
8	}
(gdb) arg
Undefined command: "arg".  Try "help".
(gdb) argc
Undefined command: "argc".  Try "help".
(gdb) argc
Undefined command: "argc".  Try "help".
(gdb) up
#1  0x00005555555551e5 in main (argc=3, argv=0x7fffffffe7d8) at hello.c:19
19	      say_hello(argv[i]);
(gdb) argc
Undefined command: "argc".  Try "help".
(gdb) q
A debugging session is active.

	Inferior 1 [process 3729925] will be killed.

Quit anyway? (y or n) y
cyang58@remote03:~/cs220/labs/lab2/exercises/1-hello-args$ make
make: 'hello' is up to date.
cyang58@remote03:~/cs220/labs/lab2/exercises/1-hello-args$ .hell[K[K[K[K[K./hello bart lisa
hello bart
hello lisa
hello (null)
cyang58@remote03:~/cs220/labs/lab2/exercises/1-hello-args$ nano hello.c.[K
[?1049h[22;0;0t[1;53r(B[m[4l[?7h[39;49m[?1h=[?1h=[?1h=[?25l[39;49m(B[m[H[2J[51;47H(B[0;7m[ Reading File ](B[m[51;53H(B[0;7m 23 lines ](B[m[H(B[0;7m  GNU nano 3.2                                       hello.c                                                 [1;108H(B[m[52d(B[0;7m^G(B[m Get Help    (B[0;7m^O(B[m Write Out   (B[0;7m^W(B[m Where Is    (B[0;7m^K(B[m Cut Text    (B[0;7m^J(B[m Justify     (B[0;7m^C(B[m Cur Pos     (B[0;7mM-U(B[m Undo[53d(B[0;7m^X(B[m Exit[53;16H(B[0;7m^R(B[m Read File   (B[0;7m^\(B[m Replace     (B[0;7m^U(B[m Uncut Text  (B[0;7m^T(B[m To Spell    (B[0;7m^_(B[m Go To Line  (B[0;7mM-E(B[m Redo[51d[3d(B[0;1m[36m#include[39m(B[m (B[0;1m[33m<stdio.h>[4d[36m#include[39m(B[m (B[0;1m[33m<stdlib.h>[6d(B[0m[32mstatic[39m(B[m [32mvoid[7d[39m(B[msay_hello([32mconst[39m(B[m [32mchar[39m(B[m *name)[8d{[9d printf((B[0;1m[33m"hello %s\n"[39m(B[m, name);[10d}[12d[32mint[39m[42m [13d[49m(B[mmain([32mint[39m(B[m argc, [32mconst[39m(B[m [32mchar[39m(B[m *argv[])[14d{[15d (B[0;1m[33mif[39m(B[m (argc == 1) {[16;5Hfprintf(stderr, (B[0;1m[33m"usage: %s NAME...\n"[39m(B[m, argv[0]);[17;5Hexit(1);[18;3H}[19d(B[0;1m[33melse[39m(B[m {[20;5H(B[0;1m[33mfor[39m(B[m ([32mint[39m(B[m i = 1; i <= argc; i++) {[21;7Hsay_hello(argv[i]);[22;5H}[23;3H}[24d[35mreturn[39m(B[m 0;[25d}[3d[?12l[?25h[?25l[4d[?12l[?25h[?25l[5d[?12l[?25h[?25l[6d[?12l[?25h[?25l[7d[?12l[?25h[?25l[8d[?12l[?25h[?25l[9d[?12l[?25h[?25l[10d[?12l[?25h[?25l[11d[?12l[?25h[?25l[12d[?12l[?25h[?25l[13d[?12l[?25h[?25l[14d[?12l[?25h[?25l[15d[?12l[?25h[?25l[16d[?12l[?25h[?25l[17d[?12l[?25h[?25l[18d[?12l[?25h[?25l [?12l[?25h[?25l [?12l[?25h[?25l}[?12l[?25h[?25l[19d[?12l[?25h[?25l [?12l[?25h[?25l [?12l[?25h[?25l[C[?12l[?25h[?25l[C[?12l[?25h[?25l[C[?12l[?25h[?25l[C[?12l[?25h[?25l[51d[K[19;8H[?12l[?25h[?25l{[?12l[?25h[?25l[20d[?12l[?25h[?25l [?12l[?25h[?25l[?12l[?25h[?25l[19;9H[?12l[?25h[?25l[?12l[?25h[?25l{[?12l[?25h[?25l[20d[?12l[?25h[?25l[21d[?12l[?25h[?25l[22;6H[?12l[?25h[?25l[23d[?12l[?25h[?25l[24;9H[?12l[?25h[?25l[25d}[?12l[?25h[?25l[26d[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[A}[?12l[?25h[?25l[24;9H[?12l[?25h[?25l[A  }[?12l[?25h[?25l[A }[?12l[?25h[?25l[A sa[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l[A  }[?12l[?25h[?25l[17;9H[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l[A{[?12l[?25h[?25l[13;9H[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l[A}[?12l[?25h[?25l[9;9H[?12l[?25h[?25l[A{[?12l[?25h[?25l[7;9H[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l[4;9H[?12l[?25h[?25l[A[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[4d[?12l[?25h[?25l[5d[?12l[?25h[?25l[6d[?12l[?25h[?25l[7d[?12l[?25h[?25l[8d[?12l[?25h[?25l[9d[?12l[?25h[?25l[10d[?12l[?25h[?25l[11d[?12l[?25h[?25l[12d[?12l[?25h[?25l[13d[?12l[?25h[?25l[14d[?12l[?25h[?25l[15d[?12l[?25h[?25l[16d[?12l[?25h[?25l[17d[?12l[?25h[?25l[18d[?12l[?25h[?25l[19d[?12l[?25h[?25l[20d[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l [?12l[?25h[?25l [?12l[?25h[?25l[17d[?12l[?25h[?25l[18d[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l [?12l[?25h[?25l [?12l[?25h[?25l}[?12l[?25h[?25l[19d[?12l[?25h[?25l [?12l[?25h[?25l[?12l[?25h[?25l[A  }[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[17;13H[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l[16d[?12l[?25h[?25l[17d[?12l[?25h[?25l[18;4H[?12l[?25h[?25l[19;9H[?12l[?25h[?25l[20;11H[?12l[?25h[?25l[51;27H(B[0;7m[ line 18/24 (75%), col 11/38 (28%), char 265/343 (77%) ](B[m[20;11H[?12l[?25h[?25l[51;84H[20;11H[?12l[?25h[?25l[C[?12l[?25h[?25l[C[?12l[?25h[?25l [?12l[?25h[?25li[?12l[?25h[?25l [?12l[?25h[?25l=[?12l[?25h[?25l [?12l[?25h[?25l1[?12l[?25h[?25l;[?12l[?25h[?25l [?12l[?25h[?25li[?12l[?25h[?25l [?12l[?25h[?25l<[?12l[?25h[?25l=[?12l[?25h[?25l[1;100H(B[0;7mModified(B[m[20;24H[1P[?12l[?25h[?25l[51d(B[0;7mSave modified buffer?  (Answering "No" will DISCARD changes.)                                                [52;1H Y(B[m Yes[K[53d(B[0;7m N(B[m No  [53;16H (B[0;7m^C(B[m Cancel[K[51;63H[?12l[?25h[?25l[52d(B[0;7m^G(B[m Get Help[52;28H(B[0;7mM-D(B[m DOS Format[52;55H(B[0;7mM-A(B[m Append[52;82H(B[0;7mM-B(B[m Backup File[53d(B[0;7m^C(B[m Cancel[17G           (B[0;7mM-M(B[m Mac Format[53;55H(B[0;7mM-P(B[m Prepend[53;82H(B[0;7m^T(B[m To Files[51d(B[0;7mFile Name to Write: hello.c                                  (B[m[51;28H[?12l[?25h[?25l[K[1;108H[1;100H(B[0;7m        (B[m[51;46H(B[0;7m[ Wrote 23 lines ](B[m[J[53;109H[?12l[?25h[53;1H[?1049l[23;0;0t[?1l>cyang58@remote03:~/cs220/labs/lab2/exercises/1-hello-args$ makle[K[Ke
cc -g -Wall -std=c11    hello.c   -o hello
cyang58@remote03:~/cs220/labs/lab2/exercises/1-hello-args$ makenano hello.c./hello bart lisa
hello bart
hello lisa
cyang58@remote03:~/cs220/labs/lab2/exercises/1-hello-args$ cd ..
cyang58@remote03:~/cs220/labs/lab2/exercises$ l[Kl[Kls
1-hello-args  2-hello-upcase-args  Makefile
cyang58@remote03:~/cs220/labs/lab2/exercises$ cd 2-hello-upcase-args/
cyang58@remote03:~/cs220/labs/lab2/exercises/2-hello-upcase-args$ ,[K./e[Khello lisa bart
bash: ./hello: No such file or directory
cyang58@remote03:~/cs220/labs/lab2/exercises/2-hello-upcase-args$ make
cc -g -Wall -std=c11    hello.c   -o hello
cyang58@remote03:~/cs220/labs/lab2/exercises/2-hello-upcase-args$ make./hello lisa bart
Hello Lisa
Hello Bart
cyang58@remote03:~/cs220/labs/lab2/exercises/2-hello-upcase-args$ ./hello lisa bart[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K./hello 'lisa  simpson' 'bart simpson'
Hello Lisa  SimpsonU
Hello Bart SimpsonöU
cyang58@remote03:~/cs220/labs/lab2/exercises/2-hello-upcase-args$ ls
hello  hello.c	Makefile  README
cyang58@remote03:~/cs220/labs/lab2/exercises/2-hello-upcase-args$ nano e[Khello.c
[?1049h[22;0;0t[1;53r(B[m[4l[?7h[39;49m[?1h=[?1h=[?1h=[?25l[39;49m(B[m[H[2J[51;47H(B[0;7m[ Reading File ](B[m[51;53H(B[0;7m 48 lines ](B[m[H(B[0;7m  GNU nano 3.2                                       hello.c                                                 [1;108H(B[m[52d(B[0;7m^G(B[m Get Help    (B[0;7m^O(B[m Write Out   (B[0;7m^W(B[m Where Is    (B[0;7m^K(B[m Cut Text    (B[0;7m^J(B[m Justify     (B[0;7m^C(B[m Cur Pos     (B[0;7mM-U(B[m Undo[53d(B[0;7m^X(B[m Exit[53;16H(B[0;7m^R(B[m Read File   (B[0;7m^\(B[m Replace     (B[0;7m^U(B[m Uncut Text  (B[0;7m^T(B[m To Spell    (B[0;7m^_(B[m Go To Line  (B[0;7mM-E(B[m Redo[51d[3d(B[0;1m[36m#include[39m(B[m (B[0;1m[33m<ctype.h>[4d[36m#include[39m(B[m (B[0;1m[33m<stdio.h>[5d[36m#include[39m(B[m (B[0;1m[33m<stdlib.h>[6d[36m#include[39m(B[m (B[0;1m[33m<string.h>[8d[34m/** Upcase the initial letter of each word from in, copying the[9d *  results into out.  The caller is responsible to ensure that out[10d *  has enough space for the strlen(in) characters of in.[11d */[12d(B[0m[32mvoid[13d[39m(B[mupcase_words([32mconst[39m(B[m [32mchar[39m(B[m in[], [32mchar[39m(B[m out[])[14d{[15d [32mint[39m(B[m inWord = 0;[16;3H[32mint[39m(B[m n = strlen(in);[17;3H(B[0;1m[33mfor[39m(B[m ([32mint[39m(B[m i = 0; i < n; i++) {[18;5H(B[0;1m[33mif[39m(B[m (!inWord && isalpha(in[i])) {[19;7Hout[i] = toupper(in[i]);[20;5H}[21d(B[0;1m[33melse[39m(B[m {[22;7Hout[i] = in[i];[23;5H}[24dinWord = isalpha(in[i]);[25;3H}[26d}[28d[32mstatic[39m(B[m [32mvoid[29d[39m(B[msay_hello([32mconst[39m(B[m [32mchar[39m(B[m *name)[30d{[31d printf((B[0;1m[33m"Hello %s\n"[39m(B[m, name);[32d}[34d[32mint[35d[39m(B[mmain([32mint[39m(B[m argc, [32mconst[39m(B[m [32mchar[39m(B[m *argv[])[36d{[37d (B[0;1m[33mif[39m(B[m (argc == 1) {[38;5Hfprintf(stderr, (B[0;1m[33m"usage: %s NAME...\n"[39m(B[m, argv[0]);[39;5Hexit(1);[40;3H}[41d(B[0;1m[33melse[39m(B[m {[42;5H(B[0;1m[33mfor[39m(B[m ([32mint[39m(B[m i = 1; i < argc; i++) {[43;7H[32mconst[39m(B[m [32mchar[39m(B[m *name = argv[i];[44;7H[32mchar[39m(B[m friendlyName[strlen(name)];[45;7Hupcase_words(name, friendlyName);[46;7Hsay_hello(friendlyName);[47;5H}[48;3H}[49d[35mreturn[39m(B[m 0;[50d}[3d[?12l[?25h[?25l[4d[?12l[?25h[?25l[5d[?12l[?25h[?25l[6d[?12l[?25h[?25l[7d[?12l[?25h[?25l[8d[?12l[?25h[?25l[9d[?12l[?25h[?25l[10d[?12l[?25h[?25l[11d[?12l[?25h[?25l[12d[?12l[?25h[?25l[13d[?12l[?25h[?25l[14d[?12l[?25h[?25l[15d[?12l[?25h[?25l[16d[?12l[?25h[?25l[17d[?12l[?25h[?25l[18d[?12l[?25h[?25l[19d[?12l[?25h[?25l[20d[?12l[?25h[?25l[21d[?12l[?25h[?25l[22d[?12l[?25h[?25l [?12l[?25h[?25l [?12l[?25h[?25l[A[?12l[?25h[?25l [?12l[?25h[?25l [?12l[?25h[?25l[C[?12l[?25h[?25l[51d[K[20;6H[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l[C[?12l[?25h[?25l [?12l[?25h[?25l([?12l[?25h[?25l![?12l[?25h[?25li[?12l[?25h[?25ln[?12l[?25h[?25lW[?12l[?25h[?25lo[?12l[?25h[?25lr[?12l[?25h[?25ld[?12l[?25h[?25l [?12l[?25h[?25l&[?12l[?25h[?25l&[?12l[?25h[?25l [?12l[?25h[?25li[?12l[?25h[?25ls[?12l[?25h[?25la[?12l[?25h[?25ll[?12l[?25h[?25lp[?12l[?25h[?25l[A[?12l[?25h[?25l[?12l[?25h[?25l[1;100H(B[0;7mModified(B[m[17;24H+; i++) {[17;25H[?12l[?25h[?25l2; i++) {[17;26H[?12l[?25h[?25l[18d[?12l[?25h[?25l[19d[?12l[?25h[?25l[20;6H[?12l[?25h[?25l[21;11H[?12l[?25h[?25l[22;22H[?12l[?25h[?25l[23;6H[?12l[?25h[?25l[24;26H[?12l[?25h[?25l[25;4H[?12l[?25h[?25l[26d[?12l[?25h[?25l[27d[?12l[?25h[?25l[28;12H[?12l[?25h[?25l[29;26H[?12l[?25h[?25l[30d{[?12l[?25h[?25l[31;26H[?12l[?25h[?25l[32d}[?12l[?25h[?25l[33d[?12l[?25h[?25l[34;4H[?12l[?25h[?25l[35;26H[?12l[?25h[?25l[36d{[?12l[?25h[?25l[37;19H[?12l[?25h[?25l[38;26H[?12l[?25h[?25l[39;13H[?12l[?25h[?25l[40;4H[?12l[?25h[?25l[41;9H[?12l[?25h[?25l[42;26H[?12l[?25h[?25l[43d[?12l[?25h[?25l[44d[?12l[?25h[?25l[45d[?12l[?25h[?25l[46d[?12l[?25h[?25l[47;6H[?12l[?25h[?25l[48d[?12l[?25h[?25l[49;12H[?12l[?25h[?25l[50d}[?12l[?25h[?25l7[3;51r8[51d[24S[1;53r[27;1H[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[?12l[?25h[?25l[51d(B[0;7mSave modified buffer?  (Answering "No" will DISCARD changes.)                                                [52;1H Y(B[m Yes[K[53d(B[0;7m N(B[m No  [53;16H (B[0;7m^C(B[m Cancel[K[51;63H[?12l[?25h[?25l[52d(B[0;7m^G(B[m Get Help[52;28H(B[0;7mM-D(B[m DOS Format[52;55H(B[0;7mM-A(B[m Append[52;82H(B[0;7mM-B(B[m Backup File[53d(B[0;7m^C(B[m Cancel[17G           (B[0;7mM-M(B[m Mac Format[53;55H(B[0;7mM-P(B[m Prepend[53;82H(B[0;7m^T(B[m To Files[51d(B[0;7mFile Name to Write: hello.c                                  (B[m[51;28H[?12l[?25h[?25l[K[1;108H[1;100H(B[0;7m        (B[m[51;46H(B[0;7m[ Wrote 48 lines ](B[m[J[53;109H[?12l[?25h[53;1H[?1049l[23;0;0t[?1l>cyang58@remote03:~/cs220/labs/lab2/exercises/2-hello-upcase-args$ mae
bash: mae: command not found
cyang58@remote03:~/cs220/labs/lab2/exercises/2-hello-upcase-args$ make
cc -g -Wall -std=c11    hello.c   -o hello
cyang58@remote03:~/cs220/labs/lab2/exercises/2-hello-upcase-args$ make[1Penano hello.cls[K./hello 'lisa  simpson' 'bart simpson'
Hello Lisa  Simpson
Hello Bart Simpson
cyang58@remote03:~/cs220/labs/lab2/exercises/2-hello-upcase-args$ ./hello 'lisa  simpson' 'bart simpson'make[K[1Penano hello.c
[?1049h[22;0;0t[1;53r(B[m[4l[?7h[39;49m[?1h=[?1h=[?1h=[?25l[39;49m(B[m[H[2J[51;47H(B[0;7m[ Reading File ](B[m[51;53H(B[0;7m 48 lines ](B[m[H(B[0;7m  GNU nano 3.2                                       hello.c                                                 [1;108H(B[m[52d(B[0;7m^G(B[m Get Help    (B[0;7m^O(B[m Write Out   (B[0;7m^W(B[m Where Is    (B[0;7m^K(B[m Cut Text    (B[0;7m^J(B[m Justify     (B[0;7m^C(B[m Cur Pos     (B[0;7mM-U(B[m Undo[53d(B[0;7m^X(B[m Exit[53;16H(B[0;7m^R(B[m Read File   (B[0;7m^\(B[m Replace     (B[0;7m^U(B[m Uncut Text  (B[0;7m^T(B[m To Spell    (B[0;7m^_(B[m Go To Line  (B[0;7mM-E(B[m Redo[51d[3d(B[0;1m[36m#include[39m(B[m (B[0;1m[33m<ctype.h>[4d[36m#include[39m(B[m (B[0;1m[33m<stdio.h>[5d[36m#include[39m(B[m (B[0;1m[33m<stdlib.h>[6d[36m#include[39m(B[m (B[0;1m[33m<string.h>[8d[34m/** Upcase the initial letter of each word from in, copying the[9d *  results into out.  The caller is responsible to ensure that out[10d *  has enough space for the strlen(in) characters of in.[11d */[12d(B[0m[32mvoid[13d[39m(B[mupcase_words([32mconst[39m(B[m [32mchar[39m(B[m in[], [32mchar[39m(B[m out[])[14d{[15d [32mint[39m(B[m inWord = 0;[16;3H[32mint[39m(B[m n = strlen(in);[17;3H(B[0;1m[33mfor[39m(B[m ([32mint[39m(B[m i = 0; i < n+2; i++) {[18;5H(B[0;1m[33mif[39m(B[m (!inWord && isalpha(in[i])) {[19;7Hout[i] = toupper(in[i]);[20;5H}[21d(B[0;1m[33melse[39m(B[m {[22;7Hout[i] = in[i];[23;5H}[24dinWord = isalpha(in[i]);[25;3H}[26d}[28d[32mstatic[39m(B[m [32mvoid[29d[39m(B[msay_hello([32mconst[39m(B[m [32mchar[39m(B[m *name)[30d{[31d printf((B[0;1m[33m"Hello %s\n"[39m(B[m, name);[32d}[34d[32mint[35d[39m(B[mmain([32mint[39m(B[m argc, [32mconst[39m(B[m [32mchar[39m(B[m *argv[])[36d{[37d (B[0;1m[33mif[39m(B[m (argc == 1) {[38;5Hfprintf(stderr, (B[0;1m[33m"usage: %s NAME...\n"[39m(B[m, argv[0]);[39;5Hexit(1);[40;3H}[41d(B[0;1m[33melse[39m(B[m {[42;5H(B[0;1m[33mfor[39m(B[m ([32mint[39m(B[m i = 1; i < argc; i++) {[43;7H[32mconst[39m(B[m [32mchar[39m(B[m *name = argv[i];[44;7H[32mchar[39m(B[m friendlyName[strlen(name)];[45;7Hupcase_words(name, friendlyName);[46;7Hsay_hello(friendlyName);[47;5H}[48;3H}[49d[35mreturn[39m(B[m 0;[50d}[3d[?12l[?25h[?25l[4d[?12l[?25h[?25l[5d[?12l[?25h[?25l[6d[?12l[?25h[?25l[7d[?12l[?25h[?25l[8d[?12l[?25h[?25l[9d[?12l[?25h[?25l[10d[?12l[?25h[?25l[11d[?12l[?25h[?25l[12d[?12l[?25h[?25l[13d[?12l[?25h[?25l[14d[?12l[?25h[?25l[15d[?12l[?25h[?25l[16d[?12l[?25h[?25l[17d[?12l[?25h[?25l[18d[?12l[?25h[?25l[19d[?12l[?25h[?25l[20d[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l [?12l[?25h[?25l [?12l[?25h[?25l[C[?12l[?25h[?25l[C[?12l[?25h[?25l[C[?12l[?25h[?25l[51d[K[17;7H[?12l[?25h[?25l([?12l[?25h[?25l[C[?12l[?25h[?25l[C[?12l[?25h[?25l[C[?12l[?25h[?25l [?12l[?25h[?25li[?12l[?25h[?25l [?12l[?25h[?25l=[?12l[?25h[?25l [?12l[?25h[?25l0[?12l[?25h[?25l;[?12l[?25h[?25l [?12l[?25h[?25li[?12l[?25h[?25l [?12l[?25h[?25l<[?12l[?25h[?25l [?12l[?25h[?25ln[?12l[?25h[?25l+[?12l[?25h[?25l2[?12l[?25h[?25l[1;100H(B[0;7mModified(B[m[17;25H[1P[?12l[?25h[?25l[1P[?12l[?25h[?25l[1P[?12l[?25h[?25l[1P[?12l[?25h[?25l ; i++) {[17;23H[?12l[?25h[?25ln; i++) {[17;24H[?12l[?25h[?25l[A[?12l[?25h[?25l[?12l[?25h[?25l+;[?12l[?25h[?25l;[K[?12l[?25h[?25l ;[?12l[?25h[?25l+;[?12l[?25h[?25l ;[?12l[?25h[?25l1;[?12l[?25h[?25l[17d[?12l[?25h[?25l[18d[?12l[?25h[?25l[19d[?12l[?25h[?25l[20;6H[?12l[?25h[?25l[21;11H[?12l[?25h[?25l[22;22H[?12l[?25h[?25l[23;6H[?12l[?25h[?25l[24;25H[?12l[?25h[?25l[25;4H[?12l[?25h[?25l[26d[?12l[?25h[?25l[27d[?12l[?25h[?25l[28;12H[?12l[?25h[?25l[32d}[?12l[?25h[?25l[33d[?12l[?25h[?25l[34;4H[?12l[?25h[?25l[35;25H[?12l[?25h[?25l[36d{[?12l[?25h[?25l[38;25H[?12l[?25h[?25l[39;13H[?12l[?25h[?25l[40;4H[?12l[?25h[?25l[41;9H[?12l[?25h[?25l[42;25H[?12l[?25h[?25l[43d[?12l[?25h[?25l[44d[?12l[?25h[?25l[45d[?12l[?25h[?25l[46d[?12l[?25h[?25l[47;6H[?12l[?25h[?25l[48d[?12l[?25h[?25l [?12l[?25h[?25l [?12l[?25h[?25l}[?12l[?25h[?25l[49d[?12l[?25h[?25l [?12l[?25h[?25l [?12l[?25h[?25l[C[?12l[?25h[?25l[C[?12l[?25h[?25l[C[?12l[?25h[?25l[C[?12l[?25h[?25l[A[?12l[?25h[?25l[A }[?12l[?25h[?25l[A [?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l[C[?12l[?25h[?25l[C[?12l[?25h[?25l[C[?12l[?25h[?25l[12G[?12l[?25h[?25lf[?12l[?25h[?25lr[?12l[?25h[?25li[?12l[?25h[?25le[?12l[?25h[?25ln[?12l[?25h[?25ld[?12l[?25h[?25ll[?12l[?25h[?25ly[?12l[?25h[?25lN[?12l[?25h[?25la[?12l[?25h[?25lm[?12l[?25h[?25le[?12l[?25h[?25l[[?12l[?25h[?25ls[?12l[?25h[?25lt[?12l[?25h[?25lr[?12l[?25h[?25ll[?12l[?25h[?25le[?12l[?25h[?25ln[?12l[?25h[?25l([?12l[?25h[?25ln[?12l[?25h[?25la[?12l[?25h[?25lm[?12l[?25h[?25le[?12l[?25h[?25l)[?12l[?25h[?25l+];[?12l[?25h[?25l1];[?12l[?25h[?25l[51d(B[0;7mSave modified buffer?  (Answering "No" will DISCARD changes.)                                                [52;1H Y(B[m Yes[K[53d(B[0;7m N(B[m No  [53;16H (B[0;7m^C(B[m Cancel[K[51;63H[?12l[?25h[?25l[52d(B[0;7m^G(B[m Get Help[52;28H(B[0;7mM-D(B[m DOS Format[52;55H(B[0;7mM-A(B[m Append[52;82H(B[0;7mM-B(B[m Backup File[53d(B[0;7m^C(B[m Cancel[17G           (B[0;7mM-M(B[m Mac Format[53;55H(B[0;7mM-P(B[m Prepend[53;82H(B[0;7m^T(B[m To Files[51d(B[0;7mFile Name to Write: hello.c                                  (B[m[51;28H[?12l[?25h[?25l[K[1;108H[1;100H(B[0;7m        (B[m[51;46H(B[0;7m[ Wrote 48 lines ](B[m[J[53;109H[?12l[?25h[53;1H[?1049l[23;0;0t[?1l>cyang58@remote03:~/cs220/labs/lab2/exercises/2-hello-upcase-args$ nano hello.c./hello 'lisa  simpson' 'bart simpson'make[K
cc -g -Wall -std=c11    hello.c   -o hello
cyang58@remote03:~/cs220/labs/lab2/exercises/2-hello-upcase-args$ makenano hello.c./hello 'lisa  simpson' 'bart simpson'
Hello Lisa  Simpson
Hello Bart Simpson
cyang58@remote03:~/cs220/labs/lab2/exercises/2-hello-upcase-args$ cd `/[K[K~/i220a[K[K[K[K[K[K[K[K[K[Kexit

Script done on 2020-09-13 20:09:40-04:00 [COMMAND_EXIT_CODE="0"]
